---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewXYZ
source: html/d8cb574d-145d-1f02-01b7-f60f4286e6d7.htm
---
# Autodesk.Revit.Creation.Application.NewXYZ Method

Creates a XYZ object at the origin.

## Syntax (C#)
```csharp
public XYZ NewXYZ()
```